fortebio/ToolEngineer/firmware/rapid4p/sdkconfig.defaults
# sdkconfig defaults - Rapid4P firmware ESP32-P4 (16 MB flash, PSRAM 200 MHz).
#
# LUU Y: file PHAI la ASCII thuan (kconfgen doc theo locale cp1252 tren Windows VN).
# Ke thua firmware-vimate-p4/sdkconfig.defaults (da chay that tren board); bo cac
# knob audio/esp-sr/WebSocket/MP4. Moi dong "vi sao" quan trong giu nguyen.

# --- Target ---
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y
# P4 rev v1.3 (board that). IDF >= 5.5.3 tach rev <3.0 va >=3.0 thanh hai nhanh loai tru
# nhau, mac dinh REV_MIN=v3.1 -> bootloader tu choi nap ("requires chip revision in range
# [v3.1 - v3.99]", gap 2026-09-17 tren IDF 5.5.4). Hai dong duoi bat nhanh <3.0; tren
# IDF 5.5.1 symbol SELECTS_REV_LESS_V3 khong ton tai (chi canh bao, REV_MIN_100 van ap).
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- Flash ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# --- PSRAM ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_CACHE_L2_CACHE_256KB=y
# L2 cache line 64 B, KHONG 128 B: ESP-Hosted cap buffer can 64 B, SDMMC/SDIO doi buffer
# can DUNG cache line -> 128 B lam SDIO toi C5 chet khi co tram ket noi (README-P4 5.2b).
CONFIG_CACHE_L2_CACHE_LINE_64B=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
# KHONG bat CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP: esp_wifi_remote RPC NO_MEM, boot-loop.
# RTC/LP RAM khong vao heap (README-P4 4.7 bay 3).
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n

# --- Bluetooth: P4 khong co radio ---
# CONFIG_BT_ENABLED is not set

# --- WiFi qua co-processor ESP32-C5 (ESP-Hosted, SDIO slot 1) ---
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C5=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# mempool transport tu PSRAM: khong bat thi "HS_MP: mempool create failed" truoc app_main.
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_RX_BA_WIN=12

# --- Partition table ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/partitions.rapid4p.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions/partitions.rapid4p.csv"

# --- CPU / FreeRTOS ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n
CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# --- LWIP / TCP ---
# 10 socket: httpd portal (4 + 1 ctrl) + DNS captive + HTTP client (README-P4 5.5).
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880

# --- HTTPS ---
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=4096
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n

# --- VFS ---
CONFIG_VFS_MAX_COUNT=12

# --- LVGL ---
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_DRAW_SW_CIRCLE_CACHE_SIZE=8
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# TJPGD: decoder_info() cap 4 KB tren stack moi lan lv_image_set_src -> tat (README-P4 5.6).
# CONFIG_LV_USE_TJPGD is not set
CONFIG_LV_USE_QRCODE=y
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y
# CONFIG_LV_USE_BUILTIN_STRING is not set
CONFIG_LV_USE_CLIB_STRING=y
# CONFIG_LV_USE_BUILTIN_SPRINTF is not set
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_FONT_MONTSERRAT_14=y
# 18: nhan trang thai header (LV_SYMBOL_WIFI/UPLOAD) - font vimate KHONG co dai symbol
# 0xF000+ nen icon ra o vuong (camera 2026-09-17); chuoi do chi ASCII nen dung Montserrat.
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_SPINBOX=y
CONFIG_LV_USE_BAR=y

# --- Log / compiler / bootloader ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_COLORS=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# --- Rapid4P ---
CONFIG_RAPID4P_BOARD_P4_43LCD=y
CONFIG_RAPID4P_SERVER_BASE="https://hub.fortebio.tech"
CONFIG_RAPID4P_OTA_INTERVAL_SEC=21600
CONFIG_RAPID4P_SCREEN_SLEEP_SEC=300
CONFIG_RAPID4P_DIAG_ENABLE=y
CONFIG_RAPID4P_DIAG_INTERVAL_SEC=60
